[
  {
    "name": "Tarun Lalwani",
    "location": "Delhi",
    "rating": 5,
    "date": "9 months ago",
    "summary": "Frozen shoulder recovery transformed my life. In 4 months, I progressed from one-to-one therapy to Care Batch with 80% recovery. Unlike physiotherapy that focused only on my shoulder, yoga strengthened my entire body.",
    "text": "Being diagnosed with Frozen Shoulder in March 2024 felt like a setback, but it turned out to be a blessing in disguise. I initially tried physiotherapy, which focused only on my shoulder, but my real transformation began when I joined Yog Chumbak in July 2024. Through dedicated one-on-one therapy, I not only regained mobility but also discovered the power of holistic healing & its deeper dimensions. In just four months, I progressed to the Care Batch, and by February 2025, I had recovered 80%. Unlike physiotherapy, yoga strengthened my entire body, bringing balance and well-being beyond just recovery. I am deeply grateful to Yog Chumbak for guiding me on this journey. It's more than just healing—it's a way of life. Yoga illuminated the whole landscape, strengthening not just my shoulder, but every aspect of my being."
  },
  {
    "name": "Anjali Arora",
    "location": "Delhi",
    "rating": 5,
    "date": "2 months ago",
    "summary": "Yoga helped me gain healthy weight and improve strength. The personalized approach with asanas suited to my body type made all the difference. Every session is something I genuinely look forward to.",
    "text": "I've always been slim, yoga has helped me gain healthy weight and not only improve my strength and flexibility. The teacher here guided me with asanas that suited my body type and gradually increased the intensity in a way that felt natural and comfortable. I never felt rushed or pressured, instead I always felt supported and encouraged to progress at my own pace. The environment here is peaceful and welcoming, which makes every session something I genuinely look forward to. Highly recommend Yog Chumbak for anyone looking for a personalised and effective yoga experience!"
  },
  {
    "name": "Sunita",
    "location": "New Delhi",
    "rating": 5,
    "date": "3 months ago",
    "summary": "In three months, I got relief from Cervical & Anxiety. The personal attention, posture correction, and care is exceptional. Yoga here works on both body and mind.",
    "text": "I joined Yog Chumbak on 16th April, 2025. In three months, I got relief in Cervical & Anxiety. They give lot of personal attention with lot of care & keep a humble attitude towards all students. Posture correction towards each one is done. Yoga here doesn't only work on body only but mind as well. I feel very good coming to Yog Chumbak. Thank you so much for your love, support & care."
  },
  {
    "name": "Sonika Garg",
    "location": "Delhi",
    "rating": 5,
    "date": "3 months ago",
    "summary": "After trying three doctors and physiotherapy for cervical spondylosis, nothing worked. Just five sessions at Yog Chumbak gave me 80% relief. Grateful beyond words.",
    "text": "I was suffering from major cervical spondylosis for over three months. I consulted three different doctors and even tried physiotherapy, but nothing brought lasting relief. Then a friend recommended Yog Chumbak, assuring me that they could truly help. And that's exactly what happened after just five sessions, I experienced an incredible 80% relief from the pain. I genuinely can't thank Ma'am enough for her guidance and healing touch. Now, I'm looking forward to continuing this beautiful journey with yoga and deepening my practice. Grateful beyond words."
  },
  {
    "name": "Rishi Saini",
    "location": "Delhi",
    "rating": 5,
    "date": "2 months ago",
    "summary": "Years of severe cervical pain, nothing worked long-term. Joining Yog Chumbak was my life's turning point. Within weeks, pain reduced drastically and I felt hopeful again.",
    "text": "I had been struggling with severe cervical pain for years, and nothing seemed to work long-term. Joining Yog Chumbak was the turning point of my life. Within weeks of practicing their guided yoga, I started feeling lighter, my pain reduced drastically, and most importantly—I felt hopeful again."
  },
  {
    "name": "Mili Chaudhary",
    "location": "Delhi",
    "rating": 5,
    "date": "9 months ago",
    "summary": "Suffering from fibromyalgia, I lived with constant pain. One trial session changed everything. Now I can think of life without pain. Individual attention makes all the difference.",
    "text": "I would like to thanks Yog Chumbak for taking very good care of my pains and aches. Once there was a time when I adjusted myself with pains as a part of my life. As I am suffering from fibromyalgia, I have severe pains in several parts of my body. Then somebody in my known told me about yog chumbak. First day I visited there and gave up by saying I can't go there it is far from my home. But my husband convinced me to take trial session. I really went there by a mood to get it reject. But taking just one session changes my mind. This Iyengar Yoga really helps me. After taking few sessions I am writing this review. Now I am in a stage where I can think my life without pains. I really appreciate the efforts done by Yog Chumbak management. There is an individual attention to everyone here."
  },
  {
    "name": "Aishwarya Jhamb",
    "location": "Delhi",
    "rating": 5,
    "date": "5 months ago",
    "summary": "One of the best wellness spaces I've found. Personalized guidance, peaceful ambiance, and focus on both physical and mental well-being. It's a holistic experience, not just exercise.",
    "text": "I've been attending sessions at Yog Chumbak for a while now, and I can confidently say it's one of the best wellness spaces I've come across. The instructor is knowledgeable, patient, and genuinely passionate about helping each person on their journey. Whether you're a beginner or experienced in yoga, the guidance is personalized and uplifting. The ambiance is peaceful and welcoming, making it the perfect escape from the chaos of daily life. What I appreciate most is their focus on both physical and mental well-being—it's not just exercise, it's a holistic experience. Highly recommended for anyone looking to improve flexibility, reduce stress, and deepen their mind-body connection. Grateful to have found this place!"
  },
  {
    "name": "Anshul Lall",
    "location": "Delhi",
    "rating": 5,
    "date": "7 months ago",
    "summary": "As a musician with physically demanding work, I struggled with chronic back pain for 2 years. Everything was temporary until Yog Chumbak. Their attention to detail is highly commendable.",
    "text": "I am a full time musician and my work is physically demanding, I had to find a way where I can take care of my lower back pain. After trying multiple other ways to fix it, everything seemed temporary. After joining Yog Chumbak, I got relief from my chronic back pain which I was experiencing for last 2 years & work isn't compromising anymore. Thanks to Yog Chumbak, their experienced Therapists carefully analysed my problem & their attention to detail while treating me is highly commendable. The centre is clean & has a cosy feel to it."
  }
]
